/* ========================================
 * System Name　　：    化交线上平台
 * SubSystem Name ：化交服务核心工具集
 * File Name: ResultCode
 * ----------------------------------------
 * Create Date/Change History 
 * ----------------------------------------
 * 04/29/16 　池 永   Create
 * 
 * 
 * ----------------------------------------
 * Copyright (c) SCEM . All rights reserved.
 */
package com.shcem.enums;

/**
 * 返回结果(业务类型)
 * 
 * @author chiyong
 * @version 1.0
 */
public enum ResultCode implements IEnumsName {

	CODE00000("00000","Service执行成功"), // Service执行成功
	CODE10101("10101","没有查询结果"), // 没有查询结果。
	CODE10102("10102","登录的数据已存在"), // 登录的数据已存在。
	CODE10103("10103","输入的参数不符合要求"), // 输入的参数不符合要求。
	CODE10104("10104","取得表集合失败"), // 取得表集合失败
	CODE10105("10105","取得表数据失败"), // 取得表数据失败
	CODE10106("10106","更新表失败"), // 更新表失败
	CODE10107("10107","删除表失败"), // 删除表失败

	// 后台系统相关
	CODE10108("10108","密码正确，登录成功"), // 密码正确，登录成功
	CODE10109("10109","密码错误，登录失败"), // 密码错误，登录失败
	CODE10110("10110","该用户编码，已经存在"), // 该用户编码，已经存在
	CODE10111("10111","该用户编码，可以使用"), // 该用户编码，可以使用
	CODE10112("10112","系统出错，联系管理员"), // 系统出错，联系管理员
	CODE10113("10113","用户名错误，登录失败"), // 用户名错误，登录失败
	CODE10114("10114","无商品交易权限"), // 无商品交易权限
	CODE10115("10115","规则引擎调用失败"), // 规则引擎调用失败
	CODE10116("10116","Activiti调用失败"), // Activiti调用失败
	CODE10117("10117","该区号不存在，请重新输入"), // 该区号不存在，请重新输入
	CODE10118("10118","重置前台客户密码失败"), // 重置前台客户密码失败
	CODE10119("10119","获取随机明码出错"), // 获取随机明码出错
	
	// 调度中心用
	CODE20000("20000","【调度中心】 执行成功！"),//【调度中心】 执行成功！
	CODE20001("20001","【调度中心】 执行异常！"),//【调度中心】 执行异常！
	
	// 规则中心用
	CODE30000("30000","【规则中心】 执行成功！"),//【规则中心】 执行成功！
	CODE30001("30001","【规则中心】 执行异常！"),//【规则中心】 执行异常！
	
	// 执行中心用
	CODE40000("40000","【执行中心】 执行成功！"),//【执行中心】 执行成功！
	CODE40001("40001","【执行中心】 执行异常！"),//【执行中心】 执行异常！
	;

	
	private String value;
	private String name;

	ResultCode(String value,String name) {
		this.value = value;
		this.name=name;
	}

	/**
	 * 获取枚举的名称
	 *
	 * @return
	 */
	@Override
	public String getName() {
		return this.name;
	}

	/**
	 * 获取枚举对应的int值
	 *
	 * @return
	 */
	@Override
	public int getIntValue() {
		return 0;
	}

	/**
	 * 获取枚举的String值
	 *
	 * @return
	 */
	@Override
	public String getStringValue() {
		return this.value;
	}
}
